БухЭксп/InformationRegisters/CW_СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ВладельцыСтатуса</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СтатусыДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьДанныеСтатусаДокумента(Объект) Экспорт
	
	Результат = Новый Структура("СтатусДокумента,Комментарий, Автор", Неопределено, Неопределено, Неопределено); 

	Если Не ПолучитьФункциональнуюОпцию("CW_ИспользуютсяСтатусыДокументов") Тогда
		 Возврат Результат;
	КонецЕсли;
	
	Если Не Справочники.CW_НазначенияСтатусов.ОбъектИспользуетсяВСистемеСтатусов(ТипЗнч(Объект)) Тогда
		 Возврат Результат;
	КонецЕсли;

	Результат.СтатусДокумента 	= ПредопределенноеЗначение("Справочник.CW_СтатусыДокументов.ПустаяСсылка"); 
	Результат.Автор 			= ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СтатусыДокументовСрезПоследних.Документ КАК Документ,
	               |	CW_СтатусыДокументовСрезПоследних.СтатусДокумента КАК СтатусДокумента,
	               |	CW_СтатусыДокументовСрезПоследних.Комментарий КАК Комментарий,
	               |	CW_СтатусыДокументовСрезПоследних.Автор КАК Автор
	               |ИЗ
	               |	РегистрСведений.CW_СтатусыДокументов.СрезПоследних(, Документ = &Документ) КАК CW_СтатусыДокументовСрезПоследних";
	
	Запрос.УстановитьПараметр("Документ", Объект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьЗаписьВРегистр(ДанныеДляЗаписи) Экспорт
	
	ТекущийСтатус = ПолучитьДанныеСтатусаДокумента(ДанныеДляЗаписи.Документ);
	
	Если ТекущийСтатус.СтатусДокумента <> ДанныеДляЗаписи.СтатусДокумента Тогда
		
		ЗаписьРегистра = РегистрыСведений.CW_СтатусыДокументов.СоздатьМенеджерЗаписи();
		
		Период = Неопределено;
		Если ДанныеДляЗаписи.Свойство("Период") Тогда
			Период = ДанныеДляЗаписи.Период;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Период) Тогда
			Период = ТекущаяДата();
		КонецЕсли;
		
		ЗаписьРегистра.Период = Период;
		
		ЗаполнитьЗначенияСвойств(ЗаписьРегистра, ДанныеДляЗаписи);
		
		ЗаписьРегистра.Записать(Истина);
		СтатусУстановлен = Истина;
	
	КонецЕсли;  
	
КонецПроцедуры

Процедура ОбновитьКомментарийЗаписиСтатуса(КлючЗаписи, Комментарий) Экспорт
	
	ЗаписьРегистра = РегистрыСведений.CW_СтатусыДокументов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ЗаписьРегистра, КлючЗаписи);
	ЗаписьРегистра.Прочитать();
	
	Если ЗаписьРегистра.Выбран() Тогда
		ЗаписьРегистра.Комментарий = Комментарий;
		ЗаписьРегистра.Записать(Истина);
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьКлючПоследнейЗаписи(Документ) Экспорт
	
	Результат = Новый Структура("Период,Документ",Неопределено,Неопределено);
	
	Запрос = Новый ЗАпрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СтатусыДокументовСрезПоследних.Период КАК Период,
	               |	CW_СтатусыДокументовСрезПоследних.Документ КАК Документ
	               |ИЗ
	               |	РегистрСведений.CW_СтатусыДокументов.СрезПоследних КАК CW_СтатусыДокументовСрезПоследних
	               |ГДЕ
	               |	CW_СтатусыДокументовСрезПоследних.Документ = &Документ";
	Запрос.УстановитьПараметр("Документ",Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
	
КонецФункции

#КонецЕсли
